Gossip_presque_final-master/app/views/users/new.html.erb

SELECT "cities".* FROM "cities"
---
  <select class="field-tag form-item select-tag" name="city">
  <% City.all.each do |city| %>