Gossip_presque_final-master/app/controllers/gossips_controller.rb

	def update
		@gossip = Gossip.find(params[:id])
		post_params = params.require(:gossip).permit(:title, :content)
		@gossip.update(post_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Ayo "], ["content", "bonjour"], ["updated_at", "2021-02-11 11:48:04.537158"], ["id", 20]]

	def create
		post_params= params.require(:gossip).permit(title:params[:title], content:params[:content])
		@gossip = Gossip.create(post_params)
---
INSERT INTO "gossips" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-02-11 11:46:40.438657"], ["updated_at", "2021-02-11 11:46:40.438657"]]