Gossip_presque_final-master/app/controllers/static_pages_controller.rb

  def home
    @all_gossips = Gossip.all
---
SELECT "gossips"."id" FROM "gossips"