Gossip_presque_final-master/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create

        User.create(email: params[:email],first_name:params[:first_name], password:params[:password])